[
  {
    "index": 0,
    "name": "Ownit",
    "position": "Software Engineer Intern",
    "photoPath": "../assets/media/ownit.jpg",
    "techStack": ["Vue.js", "React.js", "AWS", "Docker", ".Net Core"],
    "startDate": "May 2022",
    "endDate": "Dec 2022",
    "details": [
      "At Ownit, I led a solo project collaborating with stakeholders to create a serverless media management tool. This tool optimized images and videos for high-performance product pages, benefiting the product merchandising team. While challenging due to my lack of prior AWS experience, I successfully built the AWS backend (Lambda, S3, API Gateway) using Serverless Application Model. A frontend built with React.js for the tool was integrated into Ownit's internal portal. I also maintained documentation throughout the process of building the project which includes design decisions, user flow diagram, etc.",
      "The latter half of the internship I collaborated with ex-Amazon engineers to build and deploy an AWS-based merchandising portal, gaining insight into software engineering in a startup environment and emphasizing the value of documentation."
    ],
    "links": [
      {
        "title": "Landing Page",
        "href": "https://www.ownit.co/"
      },
      {
        "title": "LinkedIn",
        "href": "https://www.linkedin.com/company/ownitco/"
      }
    ]
  },
  {
    "index": 1,
    "name": "PCL Constructions",
    "position": "Student Software Developer",
    "photoPath": "../assets/media/pcl.jpg",
    "techStack": [
      "Angular.js",
      "ASP.NET Core",
      "Microsoft Azure",
      ".Net Core",
      "Docker",
      "gRPC"
    ],
    "startDate": "May 2023",
    "endDate": "Sept 2023",
    "details": [
      "At PCL Constructions, I contributed to various apps within the Job Site Suite, their job site management solution. I handled tasks across different apps, leveraging full-stack skills and adapting to Angular.js. I spent most of my time towards backend development, an area I lacked expertise in. I worked on both monolithic and microservice architectures, gaining insights into their distinctions. Notably, I independently built a reporting microservice using gRPC, from designing the data model to completion.",
      "Aside from coding, I wrote a comprehensive developer onboarding guide encompassing development processes, terminology, and local setup, primarily for my reference. This experience also highlighted the operational disparities between large companies and startups."
    ],
    "links": [
      {
        "title": "LinkedIn",
        "href": "https://www.linkedin.com/company/pcl-construction"
      }
    ]
  }
]
